import React from 'react'
import Card from '@mui/material/Card'
import CardContent from '@mui/material/CardContent'

const AboutOuchi = () => {
  return (
    <Card sx={{ minWidth: 275 }}>
      <CardContent>
        <h1 id='家庭用音ゲー部門'>家庭用音ゲー部門</h1>
        <h2 id='大会概要'>大会概要</h2>
        <p>
          感染症対策としてゲームセンターへ赴き筐体でプレーすることを自粛されてるプレイヤーも少なくない昨今の情勢を踏まえ、旧帝大の学生・OB
          を対象とした AC 音ゲー IR「音ゲー七帝戦」を拡大して家庭用部門を設けました。
        </p>
        <p>下記のいずれかを満たすことを参加資格とします。</p>
        <ol>
          <li>各旧帝大音ゲーサークルに所属している学生</li>
          <li>旧帝大在籍の学生</li>
          <li>各旧帝大音ゲーサークル OB</li>
        </ol>
        <p>
          ただし、2 と 3 については{' '}
          <u>LINE や Twitter、discord 等何かしらの手段で各音ゲーサークルに連絡を取れること</u>
          を追加の条件とします。
        </p>
        <h2 id='対象機種'>対象機種</h2>
        <ul>
          <li>Deemo</li>
          <li>Cytus</li>
          <li>プロジェクトセカイ カラフルステージ!！ feat.初音ミク</li>
          <li>バンドリ！ガールズバンドパーティー！</li>
          <li>BMS</li>
          <li>Arcaea</li>
        </ul>
        <p>このうち、Arcaea のみ Discord を用いたリアルタイム対戦形式で行います(他 IR 開催)</p>
        <p>
          この形式が好評だった場合、来年以降または七帝戦期間中(アーケード部門含む)に続けて他機種での開催も検討します。
        </p>
        <h3 id='discord-サーバー'>Discord サーバー</h3>
        <p>
          Arcaea のリアルタイム対戦において使用する discord
          サーバーは、七帝戦参加者向けに開放します。
        </p>
        <p>各大学の音ゲーサークルにて招待 URL を告知していただきます。</p>
        <p>
          持ち込み企画も大歓迎ですので、運営個人宛てまたは discord サーバー内の ＃意見・要望
          チャンネルにて連絡お願いします。
        </p>
        <h2 id='ルール'>ルール</h2>
        <p>【IR】</p>
        <ul>
          <li>
            <p>
              期間中(2/22~3/14)にプレイし専用のフォームから提出されたスコアが対象です。機種によってはリザルト画面に直接表示のないスコアを使用することがございますのでご注意ください。(例:プロセカの
              EXSCORE)
            </p>
          </li>
          <li>
            <p>
              全機種に部門が２つずつ用意され、各部門に 1 曲ずつ課題曲が設定されます。
              <br />
              全ての部門において難易度選択制です。各部門につき 1 つの難易度にのみ提出できます。
            </p>
          </li>
          <li>
            <p>
              また、機種ごとに提出制限が設定され、これを満たさないスコアの提出は無効となります。ただし、各部門で最も低い難易度で提出する場合は、制限を満たさないスコアでも提出が可能です。
            </p>
          </li>
          <li>
            <p>
              1
              人あたり何部門でも参加することが可能です。また、各機種において片方の部門のみ参加することも可能です。
            </p>
          </li>
          <li>
            <p>
              各部門毎に 1 位、30 位、150 位にそれぞれ 1500pt、1350pt、150pt
              の順位点を与え、これらで区切られる区間の点数配分が線形になるよう順位点を定めます。150
              位以下は一律で 150pt になります。
            </p>
          </li>
          <li>
            <p>
              各部門毎の順位の他に、全部門の合計 pt
              のランキングも集計します。なお、サークルランキングの実装予定はありません
            </p>
          </li>
        </ul>
        <p>【リアルタイム対戦】</p>
        <ul>
          <li>
            Arcaea
            のみリアルタイム対戦で行います。実力調査および日程調査フォームの提出が参加条件となります。こちらのフォームの集計をもとに
            2月下旬から3月上旬にかけて試合を組んでいく予定です。詳細ルールは以下機種別ルールの Arcaea
            欄をご覧ください。
          </li>
        </ul>
        <h3 id='機種別ルール'>機種別ルール</h3>
        <h4 id='【ir】deemo'>【IR】Deemo</h4>
        <ul>
          <li>
            <p>％スコアで集計を行います。</p>
          </li>
          <li>
            <p>Switch版で参加される場合、コントローラー操作は不可とさせていただきます。</p>
          </li>
          <li>
            <p>物理的に画面を隠すなどによる”疑似サドプラ”は利用可能とします。</p>
          </li>
          <li>
            <p>提出制限:70%</p>
          </li>
        </ul>
        <h4 id='【ir】cytus'>【IR】Cytus</h4>
        <ul>
          <li>
            <p>TP スコアで集計を行います。</p>
          </li>
          <li>
            <p>提出制限:70.00(TP)</p>
          </li>
        </ul>
        <h4 id='【ir】プロジェクトセカイ-カラフルステージ'>
          【IR】プロジェクトセカイ カラフルステージ
        </h4>
        <ul>
          <li>
            <p>
              PERFECT 2 点、GREAT 1 点、GOOD 以下 0 点とした EXSCORE で集計を行います。
              (スコア提出の際に参加者側で計算していただくこととなりますがご了承願います。)
            </p>
          </li>
          <li>
            <p>
              判定強化スキルの使用は不可とします。七帝戦のスコア提出用のプレイの前にはユニットに判定強化スキルを持ったキャラが含まれていないか確認をお願いします。。(原則ひとりでライブでのスコアを提出してください)
            </p>
          </li>
          <li>
            <p>提出制限:クリア</p>
          </li>
        </ul>
        <h4 id='【ir】バンドリ！ガールズバンドパーティ！'>
          【IR】バンドリ！ガールズバンドパーティ！
        </h4>
        <ul>
          <li>
            <p>
              PERFECT 2 点、GREAT 1 点、GOOD 以下 0 点とした EXSCORE
              で集計を行います。(スコア提出の際に参加者側で計算していただくこととなりますがご了承願います。)
            </p>
          </li>
          <li>
            <p>
              判定強化スキルの使用は不可とします。七帝戦のスコア提出用のプレイの前にはバンドの編成に判定強化スキルを持ったキャラが含まれていないか確認をお願いします。
            </p>
          </li>
          <li>
            <p>提出制限:クリア</p>
          </li>
        </ul>
        <h4 id='【ir】bms'>【IR】BMS</h4>
        <ul>
          <li>
            <p>EXSCORE で集計を行います。</p>
          </li>
          <li>
            <p>
              BMS プレイヤー(LR2 や beatoraja 等)の指定はありませんが、BMS プレイヤーによっては LN
              の終点判定が存在し理論値が変わってしまうことになるため、LN
              の終点判定がないモードまたは BMS プレイヤーでのスコアを提出してください。
            </p>
          </li>
          <li>
            <p>
              スコアの記録されないオプション、ゲーム難易度が極端に下がるオプションの使用は禁止です。その他オプションは使用可能です。
            </p>
          </li>
          <li>
            <p>提出制限:EASYCLEAR</p>
          </li>
        </ul>
        <h4 id='【リアルタイム対戦】arcaea'>【リアルタイム対戦】Arcaea</h4>
        <ul>
          <li>
            <p>
              Discord
              サーバーを用いたリアルタイム対戦で行います。プレイの際は可能であれば画面配信をしていただきます。不正防止及び緊張感のある良い試合を作り上げるためにご協力お願いいたします。
            </p>
          </li>
          <li>
            <p>
            Switch版で参加する場合、Touchモードでのプレイをお願いいたします。Joy-Con操作でのプレイは不可とさせていただきます。
            </p>
          </li>
          <li>
            <p>
              事前に行う実力調査および所持曲調査の結果をもとに運営側で対戦組み合わせ及び選曲制限を決定します。
            </p>
          </li>
          <li>
            <p>課題曲・対戦者それぞれの指定する自選曲の計 3 曲での対戦を行います。</p>
          </li>
          <li>
            <p>
              課題曲・自選曲勝利で 1pt、他選曲勝利で 2pt として最終的に合計 pt
              の多かったプレイヤーの勝利です。(同点はポイント変動なし)
            </p>
          </li>
          <li>
            <p>自選曲のプレイ順は試合前に曲を発表した後にルーレットで決定します。</p>
          </li>
          <li>
            <p>
              選曲に関しては事前に双方の合意が得られた場合のみ制限を無視した選曲をしてかまいませんが、円滑な進行ができるよう基本は選曲制限に従うようお願いします。
            </p>
          </li>
        </ul>
      </CardContent>
    </Card>
  )
}

export default AboutOuchi
